tests/ycsb/results/bw_bench_20260416_232722/phase1_load.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-17253/tests/ycsb/workloads/workload_bw_saturate -p recordcount=1000000 -p fieldlength=10240 -p redis.host=127.0.0.1 -p redis.port=6379 -p threadcount=16
Command line: -load -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-17253/tests/ycsb/workloads/workload_bw_saturate -p recordcount=1000000 -p fieldlength=10240 -p redis.host=127.0.0.1 -p redis.port=6379 -p threadcount=16
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-16 15:27:26:297 0 sec: 0 operations; est completion in 0 second 
2026-04-16 15:27:36:189 10 sec: 109612 operations; 10961.2 current ops/sec; est completion in 1 minute [INSERT: Count=109643, Max=36063, Min=576, Avg=1440.14, 90=1848, 99=3653, 99.9=5519, 99.99=34879] 
2026-04-16 15:27:46:189 20 sec: 210531 operations; 10091.9 current ops/sec; est completion in 1 minute [INSERT: Count=100892, Max=38623, Min=629, Avg=1580.73, 90=1840, 99=3333, 99.9=4399, 99.99=38335] 
2026-04-16 15:27:56:189 30 sec: 311007 operations; 10047.6 current ops/sec; est completion in 1 minute [INSERT: Count=100484, Max=38943, Min=595, Avg=1588.14, 90=1843, 99=3317, 99.9=4283, 99.99=38207] 
2026-04-16 15:28:06:189 40 sec: 403788 operations; 9278.1 current ops/sec; est completion in 1 minute [INSERT: Count=92776, Max=6719, Min=636, Avg=1721.03, 90=2111, 99=3515, 99.9=4755, 99.99=5739] 
2026-04-16 15:28:16:189 50 sec: 484026 operations; 8023.8 current ops/sec; est completion in 54 seconds [INSERT: Count=80243, Max=7607, Min=706, Avg=1990.49, 90=2469, 99=4387, 99.9=5655, 99.99=6939] 
2026-04-16 15:28:26:189 60 sec: 554708 operations; 7068.2 current ops/sec; est completion in 49 seconds [INSERT: Count=70678, Max=29583, Min=870, Avg=2259.91, 90=2823, 99=4751, 99.9=6019, 99.99=28991] 
2026-04-16 15:28:36:189 70 sec: 629150 operations; 7444.2 current ops/sec; est completion in 42 seconds [INSERT: Count=74435, Max=7231, Min=647, Avg=2145.82, 90=2615, 99=4435, 99.9=5583, 99.99=6583] 
2026-04-16 15:28:46:189 80 sec: 707770 operations; 7862 current ops/sec; est completion in 34 seconds [INSERT: Count=78627, Max=7927, Min=793, Avg=2031.5, 90=2491, 99=4127, 99.9=5231, 99.99=6331] 
2026-04-16 15:28:56:189 90 sec: 782630 operations; 7486 current ops/sec; est completion in 25 seconds [INSERT: Count=74857, Max=38815, Min=860, Avg=2133.7, 90=2557, 99=3967, 99.9=5379, 99.99=38015] 
2026-04-16 15:29:06:189 100 sec: 854036 operations; 7140.6 current ops/sec; est completion in 18 seconds [INSERT: Count=71404, Max=21391, Min=819, Avg=2237.11, 90=2743, 99=4503, 99.9=5835, 99.99=21119] 
2026-04-16 15:29:16:189 110 sec: 932221 operations; 7818.5 current ops/sec; est completion in 8 second [INSERT: Count=78186, Max=7179, Min=781, Avg=2042.84, 90=2515, 99=3939, 99.9=5239, 99.99=6511] 
2026-04-16 15:29:24:154 117 sec: 1000000 operations; 8508.54 current ops/sec; [CLEANUP: Count=16, Max=1409, Min=97, Avg=255, 90=232, 99=1409, 99.9=1409, 99.99=1409] [INSERT: Count=67775, Max=6343, Min=171, Avg=1866.43, 90=2251, 99=3629, 99.9=4655, 99.99=5671] 
[OVERALL], RunTime(ms), 117966
[OVERALL], Throughput(ops/sec), 8477.018802027704
[TOTAL_GCS_G1_Young_Generation], Count, 355
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 423
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.35857789532577183
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 355
[TOTAL_GC_TIME], Time(ms), 423
[TOTAL_GC_TIME_%], Time(%), 0.35857789532577183
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 255.0
[CLEANUP], MinLatency(us), 97
[CLEANUP], MaxLatency(us), 1409
[CLEANUP], 95thPercentileLatency(us), 247
[CLEANUP], 99thPercentileLatency(us), 1409
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 1881.221938
[INSERT], MinLatency(us), 171
[INSERT], MaxLatency(us), 38943
[INSERT], 95thPercentileLatency(us), 2755
[INSERT], 99thPercentileLatency(us), 4061
[INSERT], Return=OK, 1000000