tests/ycsb/results/bw_bench_20260416_232722/phase2_hotspot.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-17253/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-17253/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=32 -p redis.host=127.0.0.1 -p redis.port=6379
Command line: -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-17253/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=32 -p redis.host=127.0.0.1 -p redis.port=6379
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-16 15:29:24:596 0 sec: 79 operations; ∞ current ops/sec; est completion in 0 second [READ: Count=33, Max=29871, Min=430, Avg=9167.97, 90=25727, 99=29871, 99.9=29871, 99.99=29871] [READ-FAILED: Count=107, Max=29967, Min=158, Avg=4775.21, 90=12247, 99=29695, 99.9=29967, 99.99=29967] [UPDATE: Count=60, Max=39423, Min=1681, Avg=18852.75, 90=29711, 99=32959, 99.9=39423, 99.99=39423] [INSERT: Count=21, Max=39295, Min=2524, Avg=22038.81, 90=33023, 99=39295, 99.9=39295, 99.99=39295] 
2026-04-16 15:29:34:487 10 sec: 178396 operations; 17831.7 current ops/sec; est completion in 1 minute [READ: Count=67454, Max=16463, Min=158, Avg=1551.96, 90=2441, 99=3929, 99.9=5415, 99.99=7307] [READ-FAILED: Count=57385, Max=9047, Min=121, Avg=1529.21, 90=2425, 99=3915, 99.9=5239, 99.99=6111] [UPDATE: Count=35610, Max=8583, Min=368, Avg=1773.13, 90=2691, 99=4523, 99.9=5511, 99.99=6287] [INSERT: Count=17916, Max=11087, Min=1447, Avg=3257.84, 90=4867, 99=7079, 99.9=9175, 99.99=10399] 
2026-04-16 15:29:44:487 20 sec: 402180 operations; 22378.4 current ops/sec; est completion in 1 minute [READ: Count=90290, Max=5771, Min=124, Avg=1263.97, 90=1887, 99=2839, 99.9=4087, 99.99=5223] [READ-FAILED: Count=66517, Max=5947, Min=83, Avg=1238.48, 90=1856, 99=2793, 99.9=4023, 99.99=4871] [UPDATE: Count=44544, Max=5691, Min=423, Avg=1430.35, 90=2135, 99=3175, 99.9=4579, 99.99=5463] [INSERT: Count=22331, Max=10367, Min=1369, Avg=2625.65, 90=3515, 99=5323, 99.9=6967, 99.99=9239] 
2026-04-16 15:29:54:487 30 sec: 623189 operations; 22100.9 current ops/sec; est completion in 1 minute [READ: Count=90713, Max=42207, Min=132, Avg=1278.02, 90=1901, 99=2947, 99.9=4499, 99.99=31407] [READ-FAILED: Count=64058, Max=42303, Min=103, Avg=1252.57, 90=1872, 99=2907, 99.9=4519, 99.99=11087] [UPDATE: Count=43945, Max=31983, Min=328, Avg=1446.77, 90=2167, 99=3345, 99.9=5003, 99.99=31535] [INSERT: Count=22283, Max=43391, Min=1235, Avg=2670.75, 90=3639, 99=5643, 99.9=8147, 99.99=42591] 
2026-04-16 15:30:04:486 40 sec: 811551 operations; 18836.2 current ops/sec; est completion in 59 seconds [READ: Count=78206, Max=41023, Min=173, Avg=1500.74, 90=2279, 99=3407, 99.9=5151, 99.99=40031] [READ-FAILED: Count=53746, Max=40671, Min=177, Avg=1466.99, 90=2241, 99=3331, 99.9=5063, 99.99=39839] [UPDATE: Count=37437, Max=41055, Min=514, Avg=1699.65, 90=2531, 99=4041, 99.9=5679, 99.99=40543] [INSERT: Count=18977, Max=42207, Min=1632, Avg=3123.72, 90=4287, 99=6555, 99.9=8855, 99.99=41311] 
2026-04-16 15:30:14:487 50 sec: 1004405 operations; 19285.4 current ops/sec; est completion in 50 seconds [READ: Count=80241, Max=6731, Min=160, Avg=1464.5, 90=2189, 99=3287, 99.9=4915, 99.99=6015] [READ-FAILED: Count=54532, Max=6579, Min=171, Avg=1434.2, 90=2165, 99=3227, 99.9=4835, 99.99=5907] [UPDATE: Count=38605, Max=6719, Min=407, Avg=1660.82, 90=2467, 99=3787, 99.9=5199, 99.99=6279] [INSERT: Count=19491, Max=10919, Min=1434, Avg=3045.35, 90=4063, 99=6143, 99.9=8091, 99.99=10463] 
2026-04-16 15:30:24:487 60 sec: 1221058 operations; 21665.3 current ops/sec; est completion in 39 seconds [READ: Count=90456, Max=26975, Min=157, Avg=1305.69, 90=1952, 99=3105, 99.9=4799, 99.99=25903] [READ-FAILED: Count=60986, Max=27103, Min=132, Avg=1278.74, 90=1916, 99=3083, 99.9=4519, 99.99=6443] [UPDATE: Count=43560, Max=27135, Min=341, Avg=1473.87, 90=2237, 99=3465, 99.9=5187, 99.99=26511] [INSERT: Count=21659, Max=29231, Min=1156, Avg=2719.83, 90=3753, 99=5979, 99.9=8271, 99.99=28543] 
2026-04-16 15:30:34:487 70 sec: 1457618 operations; 23656 current ops/sec; est completion in 27 seconds [READ: Count=99070, Max=5675, Min=110, Avg=1195.76, 90=1783, 99=2585, 99.9=3857, 99.99=4783] [READ-FAILED: Count=66249, Max=6343, Min=147, Avg=1171.35, 90=1752, 99=2551, 99.9=3785, 99.99=4543] [UPDATE: Count=47549, Max=5623, Min=327, Avg=1346.4, 90=2000, 99=2901, 99.9=4287, 99.99=4987] [INSERT: Count=23689, Max=9095, Min=1269, Avg=2493.61, 90=3321, 99=4907, 99.9=6603, 99.99=8463] 
2026-04-16 15:30:44:486 80 sec: 1689005 operations; 23138.7 current ops/sec; est completion in 15 seconds [READ: Count=96998, Max=5955, Min=116, Avg=1224.36, 90=1820, 99=2653, 99.9=3963, 99.99=4891] [READ-FAILED: Count=65205, Max=5099, Min=120, Avg=1200.85, 90=1802, 99=2591, 99.9=3883, 99.99=4671] [UPDATE: Count=46117, Max=5131, Min=525, Avg=1377.77, 90=2047, 99=2969, 99.9=4271, 99.99=4923] [INSERT: Count=23023, Max=9415, Min=1248, Avg=2544.91, 90=3367, 99=5023, 99.9=6791, 99.99=8815] 
2026-04-16 15:30:54:487 90 sec: 1921488 operations; 23248.3 current ops/sec; est completion in 4 second [READ: Count=97069, Max=6279, Min=141, Avg=1213.95, 90=1808, 99=2691, 99.9=3911, 99.99=4887] [READ-FAILED: Count=65683, Max=6295, Min=97, Avg=1196.19, 90=1802, 99=2679, 99.9=3953, 99.99=4707] [UPDATE: Count=46251, Max=6291, Min=310, Avg=1371.78, 90=2044, 99=3085, 99.9=4287, 99.99=5419] [INSERT: Count=23461, Max=8327, Min=1315, Avg=2529.08, 90=3381, 99=5059, 99.9=6559, 99.99=7935] 
2026-04-16 15:30:57:962 93 sec: 2000000 operations; 22586.88 current ops/sec; [READ: Count=32614, Max=5987, Min=40, Avg=1225.33, 90=1820, 99=2769, 99.9=4127, 99.99=5371] [CLEANUP: Count=32, Max=1111, Min=65, Avg=182.75, 90=237, 99=1111, 99.9=1111, 99.99=1111] [READ-FAILED: Count=22255, Max=5107, Min=26, Avg=1199.73, 90=1796, 99=2711, 99.9=3815, 99.99=4643] [UPDATE: Count=15828, Max=5511, Min=112, Avg=1397.9, 90=2111, 99=3047, 99.9=4635, 99.99=5491] [INSERT: Count=7776, Max=9615, Min=169, Avg=2570.35, 90=3451, 99=5283, 99.9=7223, 99.99=8639] 
[OVERALL], RunTime(ms), 93476
[OVERALL], Throughput(ops/sec), 21395.866318627242
[TOTAL_GCS_G1_Young_Generation], Count, 331
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 360
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3851255937352903
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 331
[TOTAL_GC_TIME], Time(ms), 360
[TOTAL_GC_TIME_%], Time(%), 0.3851255937352903
[READ], Operations, 823144
[READ], AverageLatency(us), 1315.757364446561
[READ], MinLatency(us), 40
[READ], MaxLatency(us), 42207
[READ], 95thPercentileLatency(us), 2319
[READ], 99thPercentileLatency(us), 3073
[READ], Return=OK, 823144
[READ], Return=ERROR, 576723
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 182.75
[CLEANUP], MinLatency(us), 65
[CLEANUP], MaxLatency(us), 1111
[CLEANUP], 95thPercentileLatency(us), 251
[CLEANUP], 99thPercentileLatency(us), 1111
[READ-FAILED], Operations, 576723
[READ-FAILED], AverageLatency(us), 1295.4110014686426
[READ-FAILED], MinLatency(us), 26
[READ-FAILED], MaxLatency(us), 42303
[READ-FAILED], 95thPercentileLatency(us), 2309
[READ-FAILED], 99thPercentileLatency(us), 3063
[UPDATE], Operations, 399506
[UPDATE], AverageLatency(us), 1493.4506565608526
[UPDATE], MinLatency(us), 112
[UPDATE], MaxLatency(us), 41055
[UPDATE], 95thPercentileLatency(us), 2563
[UPDATE], 99thPercentileLatency(us), 3565
[UPDATE], Return=OK, 399506
[INSERT], Operations, 200627
[INSERT], AverageLatency(us), 2748.905959815977
[INSERT], MinLatency(us), 169
[INSERT], MaxLatency(us), 43391
[INSERT], 95thPercentileLatency(us), 4431
[INSERT], 99thPercentileLatency(us), 5915
[INSERT], Return=OK, 200627